/////////////////测试数据
var getStatistics = {
    "铜川耀州气象监测表": [
        {
            "PRS": 992.8,
            "时间": "2018-12-17 21:00:00",
            "Id": 398,
            "统计项目": "最大值",
            "WIN_S": 6.6,
            "WIN_D": 359.0,
            "TEM": 14.5,
            "RHU": 96.0
        },
        {
            "PRS": 966.4,
            "时间": "2018-11-29 08:00:00",
            "Id": 1,
            "统计项目": "最小值",
            "WIN_S": 0.0,
            "WIN_D": 0.0,
            "TEM": -7.3,
            "RHU": 18.0
        },
        {
            "PRS": 980.952010050252,
            "时间": 2018.0,
            "Id": 199.5000,
            "统计项目": "平均值",
            "WIN_S": 2.1552763819095473,
            "WIN_D": 127.28140703517587,
            "TEM": 2.3685929648241197,
            "RHU": 46.163316582914575
        },
        {
            "PRS": 5.901293059897492,
            "时间": 0.0,
            "Id": 114.8923409109589,
            "统计项目": "标准差",
            "WIN_S": 1.2660069775998999,
            "WIN_D": 101.18127026923828,
            "TEM": 4.7647041417007685,
            "RHU": 20.495641430399164
        }
    ],
    "宝鸡渭滨区水质监测表": [
        {
            "SO₄²ˉ": 14.349,
            "Clˉ": 1.517,
            "Sample ID": "19-Q-0264",
            "Na+": 1.71,
            "Id": 342,
            "统计项目": "最大值",
            "NO₃ˉ": 26.38
        },
        {
            "SO₄²ˉ": 0.229,
            "Clˉ": 0.084,
            "Sample ID": "18-Q-2784",
            "Na+": 0.229,
            "Id": 1,
            "统计项目": "最小值",
            "NO₃ˉ": 0.0
        },
        {
            "SO₄²ˉ": 2.17872514619883,
            "Clˉ": 0.5168830409356724,
            "Sample ID": 18.08187134502924,
            "Na+": 0.826404970760234,
            "Id": 171.5000,
            "统计项目": "平均值",
            "NO₃ˉ": 4.2076403508771945
        },
        {
            "SO₄²ˉ": 1.797858646002265,
            "Clˉ": 0.2754389071713274,
            "Sample ID": 0.2741686121574519,
            "Na+": 0.4371873023252995,
            "Id": 98.72647399085344,
            "统计项目": "标准差",
            "NO₃ˉ": 4.112730998422989
        }
    ],
    "西安未央气象监测表": [
        {
            "NO2": 158.0,
            "时间": "2017-03-31 23:00",
            "O3": 197.0,
            "SO2": 82.0,
            "PM₂.₅": 575.0,
            "PM10": 693.0,
            "AQI": 500.0,
            "Id": 4368,
            "统计项目": "最大值",
            "CO": 5.6
        },
        {
            "NO2": 12.0,
            "时间": "2016-10-01 00:00",
            "O3": 4.0,
            "SO2": 5.0,
            "PM₂.₅": 6.0,
            "PM10": 16.0,
            "AQI": 17.0,
            "Id": 1,
            "统计项目": "最小值",
            "CO": 0.5
        },
        {
            "NO2": 68.00595238095238,
            "时间": 2016.4945054945056,
            "O3": 28.175595238095237,
            "SO2": 27.4654304029304,
            "PM₂.₅": 122.63255494505495,
            "PM10": 187.9278846153846,
            "AQI": 161.21955128205127,
            "Id": 2184.5000,
            "统计项目": "平均值",
            "CO": 2.0205128205128178
        },
        {
            "NO2": 27.639654737708156,
            "时间": 0.49996980949894304,
            "O3": 26.030748928057786,
            "SO2": 14.098771638675297,
            "PM₂.₅": 97.84230468818538,
            "PM10": 117.41521791604522,
            "AQI": 104.17299077907508,
            "Id": 1260.9329548658275,
            "统计项目": "标准差",
            "CO": 0.8647982004440752
        }
    ]
}

/////////////////////////////////////////
layui.use(['table', 'jquery'], function () {
    var table = layui.table;
    const $ = layui.jquery;
    var data1 = data1;
    var res = getStatistics;
    //console.log(res)
    data1 = res[getQueryVariable("tableName")];
    var col = [[{ field: '统计项目', title: '统计项目' }]];
    for (var key in data1[0]) {
        if (key == '统计项目') continue;
        var item = { field: key, title: key }
        col[0].push(item)
    }
    table.render({
        elem: '#test'
        , data: data1
        , height: 'full'
        , even: 'true'
        , size: 'sm'
        , cellMinWidth: 100 //全局定义常规单元格的最小宽度，layui 2.2.1 新增
        , toolbar: '#toolbarDemo' //开启头部工具栏，并为其绑定左侧模板
        , defaultToolbar: ['filter', 'print', "exports"]
        , cols: col
    });




});